package lesson02.referenceType;

public class Dog {
    int age;
    double weight;

    //  добавляю конструктор, который позволяет создавать новые экземпляры класса (новые обьекты на основании класса Dog).
    // Это позволяет создавать новые обьекты сразу вводя необходимые переменные (характеристики обьекта - age, weight), а
    // не создавая их отдельно, обращаясь каждый раз к классу и через точку к конкрентной переменной.

/*
    public Dog(int age, double weight) {
        this.age = age;
        this.weight = weight;
    }

    // добвляем метод toString (встроенный метод), к-й позволяет сразу выыводить на печать все,
    // что относится к обьекту (а не каждую переменную поотдельности).



    @Override
    public String toString() {
        return "Dog{" +
                "age=" + age +
                ", weight=" + weight +
                '}';
   */


}
